[
  {
    "type": "experience",
    "company": "Reikon Games",
    "logo": "/images/company-logos/reikongames.png",
    "roles": [
      {
        "title": "IT Manager",
        "period": "Sep 2024 – Present",
        "responsibilities": [
          "Spearheading the development and maintenance of network infrastructure",
          "Leading the modernization and expansion of server infrastructure",
          "Managing asset logistics, including the organization of equipment deliveries",
          "Overseeing the monitoring and performance of the overall IT infrastructure",
          "Supervising user account and access management (AD, Google, Slack, Access Control System)",
          "Directing the administration of various SaaS platforms",
          "Overseeing server administration for Linux (Debian, Ubuntu) and Windows Server 2022",
          "Providing and managing second-line technical support (L2)",
          "Ensuring the maintenance of comprehensive technical documentation",
          "Collaborating in the creation and enforcement of IT policies and procedures",
          "Training and mentoring team members and users for enhanced operational efficiency",
          "Managing licenses and subscriptions"
        ],
        "skills": "Agile Development, IT Project & Program Management, Linux, Windows Server, Networking, Cybersecurity, Cloud Computing, SaaS Management"
      },
      {
        "title": "IT Assistant",
        "period": "Jan 2023 – Sep 2024",
        "responsibilities": [
          "Organizing asset delivery and equipment preparation",
          "Overseeing IT infrastructure monitoring",
          "Providing first-line technical support (L1)",
          "Managing user accounts and access (AD, Google, Slack, Access Control System)",
          "Administering SaaS platforms",
          "Handling server administration on Linux (Debian, Ubuntu) and Windows Server 2022",
          "Maintaining technical documentation",
          "Assisting with IT policy and procedure development",
          "Contributing to server infrastructure setup",
          "Managed assets system",
          "Conducting technical onboarding for users"
        ],
        "skills": "Linux, Windows Server, Networking, IT Support, Help Desk, Active Directory, Google Workspace, Slack, Jira, Asset Management"
      }
    ]
  },
  {
    "type": "experience",
    "company": "CIE Center for Innovative Education",
    "logo": "/images/company-logos/cie-logo.png",
    "roles": [
      {
        "title": "Dział planowania i analizy kosztów",
        "period": "Aug 2020 – Aug 2022",
        "responsibilities": [
          "Analyzing planning and cost data to identify areas for efficiency improvement.",
          "Assisting with budget preparation and financial reporting.",
          "Developing tools for data visualization and performance tracking."
        ],
        "skills": "Adobe Photoshop, Adobe Premiere Pro, Data Analysis, Cost Management"
      }
    ]
  },
  {
    "type": "experience",
    "company": "Orange Polska",
    "logo": "/images/company-logos/orange.png",
    "roles": [
      {
        "title": "Praktykant",
        "period": "Jan 2020 – Aug 2020",
        "responsibilities": [
          "Participating in projects related to customer experience (CEX) analysis.",
          "Assisting with user research and UX design processes.",
          "Contributing to mobile application testing and bug reporting."
        ],
        "skills": "Adobe Photoshop, User Experience (UX), Mobile Application Testing, Customer Experience"
      }
    ]
  },
  {
    "type": "experience",
    "company": "European Parliament",
    "logo": "/images/company-logos/european-parliament.png",
    "roles": [
      {
        "title": "Intern in the Warsaw office of Danuta Hübner",
        "period": "Jan 2018 – Jun 2018",
        "location": "Warsaw, Mazowieckie, Poland",
        "responsibilities": [
          "Assisting with research on European studies and civilization topics.",
          "Preparing reports and presentations for internal use.",
          "Supporting general office administration tasks."
        ],
        "skills": "Adobe Photoshop, Adobe Premiere Pro, Research, Administrative Support"
      }
    ]
  },
  {
    "type": "education",
    "university": "Warsaw University of Technology",
    "logo": "/images/university-logos/politechnika.png",
    "degree": "Master's degree, Computer Science",
    "period": "Oct 2024 – May 2026",
    "skills": "Debugging, User Experience (UX), Algorithms, LAN-WAN, Agile Development, GitHub, REST APIs, Databases, Programming, Jira, Troubleshooting, Application Servers, Networking, Node.js, Operating Systems, Problem Solving, Software Development, HTML5, Scriptwriting, Windows, Network Security"
  },
  {
    "type": "education",
    "university": "Polish-Japanese Academy of Information Technology",
    "logo": "/images/university-logos/pjatk.png",
    "degree": "Informatyka",
    "period": "Oct 2020 – Jan 2024",
    "skills": "Debugging, User Experience (UX), Adobe Premiere Pro, Algorithms, LAN-WAN, Agile Development, Web Development, Java, Dashboards, GitHub, REST APIs, Databases, React.js, Programming, Web Design, C#, Jira, Project Management, Java Spring Boot, Troubleshooting, Application Servers, Web Services, Networking, Node.js, Operating Systems, Cascading Style Sheets (CSS), Problem Solving, Software Development, MongoDB, Content Management Systems (CMS), Microsoft Office, HTML5, Adobe Photoshop, Computer Repair, JavaScript, Network Troubleshooting, Scriptwriting, Web Applications, Windows, HTML, Network Security"
  },
  {
    "type": "education",
    "university": "University of Warsaw",
    "logo": "/images/university-logos/uw.png",
    "degree": "European Studies/Civilization",
    "period": "2016 – 2020",
    "skills": "Microsoft Office, Basic Economics, Basic Law"
  }
]